tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "ack"
brew "python@3.11"
brew "bat"
brew "python@3.12"
brew "libx11"
brew "openjdk"
brew "clojure"
brew "cocoapods", link: false
brew "lima"
brew "colima"
brew "direnv"
brew "docker"
brew "figlet"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint", link: false
brew "jq"
brew "zookeeper"
brew "kafka"
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "most"
brew "neovim"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@8"
brew "perl"
brew "postgresql@14", restart_service: true
brew "pushpin"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-jetbrains-mono-nerd-font"
cask "insomnia"
cask "iterm2"
cask "orbstack"
cask "rectangle"
cask "visual-studio-code"
vscode "azemoh.one-monokai"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
